GopalSaraf/Practicals/PSDL/include/proc/pic12f675.inc
// Register: T1CON
#define T1CON T1CON
T1CON                                    equ 0010h
// bitfield definitions
T1CON_TMR1ON_POSN                        equ 0000h
T1CON_TMR1ON_POSITION                    equ 0000h
T1CON_TMR1ON_SIZE                        equ 0001h
T1CON_TMR1ON_LENGTH                      equ 0001h
T1CON_TMR1ON_MASK                        equ 0001h
T1CON_TMR1CS_POSN                        equ 0001h
T1CON_TMR1CS_POSITION                    equ 0001h
T1CON_TMR1CS_SIZE                        equ 0001h
T1CON_TMR1CS_LENGTH                      equ 0001h
T1CON_TMR1CS_MASK                        equ 0002h
T1CON_nT1SYNC_POSN                       equ 0002h
T1CON_nT1SYNC_POSITION                   equ 0002h
T1CON_nT1SYNC_SIZE                       equ 0001h
T1CON_nT1SYNC_LENGTH                     equ 0001h
T1CON_nT1SYNC_MASK                       equ 0004h
T1CON_T1OSCEN_POSN                       equ 0003h
T1CON_T1OSCEN_POSITION                   equ 0003h
T1CON_T1OSCEN_SIZE                       equ 0001h
T1CON_T1OSCEN_LENGTH                     equ 0001h
T1CON_T1OSCEN_MASK                       equ 0008h
T1CON_T1CKPS_POSN                        equ 0004h
T1CON_T1CKPS_POSITION                    equ 0004h
T1CON_T1CKPS_SIZE                        equ 0002h
T1CON_T1CKPS_LENGTH                      equ 0002h
T1CON_T1CKPS_MASK                        equ 0030h
T1CON_TMR1GE_POSN                        equ 0006h
T1CON_TMR1GE_POSITION                    equ 0006h
T1CON_TMR1GE_SIZE                        equ 0001h
T1CON_TMR1GE_LENGTH                      equ 0001h
T1CON_TMR1GE_MASK                        equ 0040h
T1CON_T1CKPS0_POSN                       equ 0004h
T1CON_T1CKPS0_POSITION                   equ 0004h
T1CON_T1CKPS0_SIZE                       equ 0001h
T1CON_T1CKPS0_LENGTH                     equ 0001h
T1CON_T1CKPS0_MASK                       equ 0010h
T1CON_T1CKPS1_POSN                       equ 0005h
T1CON_T1CKPS1_POSITION                   equ 0005h
T1CON_T1CKPS1_SIZE                       equ 0001h
T1CON_T1CKPS1_LENGTH                     equ 0001h
T1CON_T1CKPS1_MASK                       equ 0020h

// Register: CMCON
#define CMCON CMCON
CMCON                                    equ 0019h
// bitfield definitions
CMCON_CM_POSN                            equ 0000h
CMCON_CM_POSITION                        equ 0000h
CMCON_CM_SIZE                            equ 0003h
CMCON_CM_LENGTH                          equ 0003h
CMCON_CM_MASK                            equ 0007h
CMCON_CIS_POSN                           equ 0003h
CMCON_CIS_POSITION                       equ 0003h
CMCON_CIS_SIZE                           equ 0001h
CMCON_CIS_LENGTH                         equ 0001h
CMCON_CIS_MASK                           equ 0008h
CMCON_CINV_POSN                          equ 0004h
CMCON_CINV_POSITION                      equ 0004h
CMCON_CINV_SIZE                          equ 0001h
CMCON_CINV_LENGTH                        equ 0001h
CMCON_CINV_MASK                          equ 0010h
CMCON_COUT_POSN                          equ 0006h
CMCON_COUT_POSITION                      equ 0006h
CMCON_COUT_SIZE                          equ 0001h
CMCON_COUT_LENGTH                        equ 0001h
CMCON_COUT_MASK                          equ 0040h
CMCON_CM0_POSN                           equ 0000h
CMCON_CM0_POSITION                       equ 0000h
CMCON_CM0_SIZE                           equ 0001h
CMCON_CM0_LENGTH                         equ 0001h
CMCON_CM0_MASK                           equ 0001h
CMCON_CM1_POSN                           equ 0001h
CMCON_CM1_POSITION                       equ 0001h
CMCON_CM1_SIZE                           equ 0001h
CMCON_CM1_LENGTH                         equ 0001h
CMCON_CM1_MASK                           equ 0002h
CMCON_CM2_POSN                           equ 0002h
CMCON_CM2_POSITION                       equ 0002h
CMCON_CM2_SIZE                           equ 0001h
CMCON_CM2_LENGTH                         equ 0001h
CMCON_CM2_MASK                           equ 0004h

// Register: ADRESH
#define ADRESH ADRESH
ADRESH                                   equ 001Eh
// bitfield definitions
ADRESH_ADRESH_POSN                       equ 0000h
ADRESH_ADRESH_POSITION                   equ 0000h
ADRESH_ADRESH_SIZE                       equ 0008h
ADRESH_ADRESH_LENGTH                     equ 0008h
ADRESH_ADRESH_MASK                       equ 00FFh

// Register: ADCON0
#define ADCON0 ADCON0
ADCON0                                   equ 001Fh
// bitfield definitions
ADCON0_ADON_POSN                         equ 0000h
ADCON0_ADON_POSITION                     equ 0000h
ADCON0_ADON_SIZE                         equ 0001h
ADCON0_ADON_LENGTH                       equ 0001h
ADCON0_ADON_MASK                         equ 0001h
ADCON0_GO_nDONE_POSN                     equ 0001h
ADCON0_GO_nDONE_POSITION                 equ 0001h
ADCON0_GO_nDONE_SIZE                     equ 0001h
ADCON0_GO_nDONE_LENGTH                   equ 0001h
ADCON0_GO_nDONE_MASK                     equ 0002h
ADCON0_CHS_POSN                          equ 0002h
ADCON0_CHS_POSITION                      equ 0002h
ADCON0_CHS_SIZE                          equ 0002h
ADCON0_CHS_LENGTH                        equ 0002h
ADCON0_CHS_MASK                          equ 000Ch
ADCON0_VCFG_POSN                         equ 0006h
ADCON0_VCFG_POSITION                     equ 0006h
ADCON0_VCFG_SIZE                         equ 0001h
ADCON0_VCFG_LENGTH                       equ 0001h
ADCON0_VCFG_MASK                         equ 0040h
ADCON0_ADFM_POSN                         equ 0007h
ADCON0_ADFM_POSITION                     equ 0007h
ADCON0_ADFM_SIZE                         equ 0001h
ADCON0_ADFM_LENGTH                       equ 0001h
ADCON0_ADFM_MASK                         equ 0080h
ADCON0_GO_DONE_POSN                      equ 0001h
ADCON0_GO_DONE_POSITION                  equ 0001h
ADCON0_GO_DONE_SIZE                      equ 0001h
ADCON0_GO_DONE_LENGTH                    equ 0001h
ADCON0_GO_DONE_MASK                      equ 0002h
ADCON0_CHS0_POSN                         equ 0002h
ADCON0_CHS0_POSITION                     equ 0002h
ADCON0_CHS0_SIZE                         equ 0001h
ADCON0_CHS0_LENGTH                       equ 0001h
ADCON0_CHS0_MASK                         equ 0004h
ADCON0_CHS1_POSN                         equ 0003h
ADCON0_CHS1_POSITION                     equ 0003h
ADCON0_CHS1_SIZE                         equ 0001h
ADCON0_CHS1_LENGTH                       equ 0001h
ADCON0_CHS1_MASK                         equ 0008h
ADCON0_nDONE_POSN                        equ 0001h
ADCON0_nDONE_POSITION                    equ 0001h
ADCON0_nDONE_SIZE                        equ 0001h
ADCON0_nDONE_LENGTH                      equ 0001h
ADCON0_nDONE_MASK                        equ 0002h
ADCON0_GO_POSN                           equ 0001h
ADCON0_GO_POSITION                       equ 0001h
ADCON0_GO_SIZE                           equ 0001h
ADCON0_GO_LENGTH                         equ 0001h
ADCON0_GO_MASK                           equ 0002h

// Register: OPTION_REG
#define OPTION_REG OPTION_REG
OPTION_REG                               equ 0081h
// bitfield definitions
OPTION_REG_PS_POSN                       equ 0000h
OPTION_REG_PS_POSITION                   equ 0000h
OPTION_REG_PS_SIZE                       equ 0003h
OPTION_REG_PS_LENGTH                     equ 0003h
OPTION_REG_PS_MASK                       equ 0007h
OPTION_REG_PSA_POSN                      equ 0003h
OPTION_REG_PSA_POSITION                  equ 0003h
OPTION_REG_PSA_SIZE                      equ 0001h
OPTION_REG_PSA_LENGTH                    equ 0001h
OPTION_REG_PSA_MASK                      equ 0008h
OPTION_REG_T0SE_POSN                     equ 0004h
OPTION_REG_T0SE_POSITION                 equ 0004h
OPTION_REG_T0SE_SIZE                     equ 0001h
OPTION_REG_T0SE_LENGTH                   equ 0001h
OPTION_REG_T0SE_MASK                     equ 0010h
OPTION_REG_T0CS_POSN                     equ 0005h
OPTION_REG_T0CS_POSITION                 equ 0005h
OPTION_REG_T0CS_SIZE                     equ 0001h
OPTION_REG_T0CS_LENGTH                   equ 0001h
OPTION_REG_T0CS_MASK                     equ 0020h
OPTION_REG_INTEDG_POSN                   equ 0006h
OPTION_REG_INTEDG_POSITION               equ 0006h
OPTION_REG_INTEDG_SIZE                   equ 0001h
OPTION_REG_INTEDG_LENGTH                 equ 0001h
OPTION_REG_INTEDG_MASK                   equ 0040h
OPTION_REG_nGPPU_POSN                    equ 0007h
OPTION_REG_nGPPU_POSITION                equ 0007h
OPTION_REG_nGPPU_SIZE                    equ 0001h
OPTION_REG_nGPPU_LENGTH                  equ 0001h
OPTION_REG_nGPPU_MASK                    equ 0080h
OPTION_REG_PS0_POSN                      equ 0000h
OPTION_REG_PS0_POSITION                  equ 0000h
OPTION_REG_PS0_SIZE                      equ 0001h
OPTION_REG_PS0_LENGTH                    equ 0001h
OPTION_REG_PS0_MASK                      equ 0001h
OPTION_REG_PS1_POSN                      equ 0001h
OPTION_REG_PS1_POSITION                  equ 0001h
OPTION_REG_PS1_SIZE                      equ 0001h
OPTION_REG_PS1_LENGTH                    equ 0001h
OPTION_REG_PS1_MASK                      equ 0002h
OPTION_REG_PS2_POSN                      equ 0002h
OPTION_REG_PS2_POSITION                  equ 0002h
OPTION_REG_PS2_SIZE                      equ 0001h
OPTION_REG_PS2_LENGTH                    equ 0001h
OPTION_REG_PS2_MASK                      equ 0004h

// Register: TRISIO
#define TRISIO TRISIO
TRISIO                                   equ 0085h
// bitfield definitions
TRISIO_TRISIO0_POSN                      equ 0000h
TRISIO_TRISIO0_POSITION                  equ 0000h
TRISIO_TRISIO0_SIZE                      equ 0001h
TRISIO_TRISIO0_LENGTH                    equ 0001h
TRISIO_TRISIO0_MASK                      equ 0001h
TRISIO_TRISIO1_POSN                      equ 0001h
TRISIO_TRISIO1_POSITION                  equ 0001h
TRISIO_TRISIO1_SIZE                      equ 0001h
TRISIO_TRISIO1_LENGTH                    equ 0001h
TRISIO_TRISIO1_MASK                      equ 0002h
TRISIO_TRISIO2_POSN                      equ 0002h
TRISIO_TRISIO2_POSITION                  equ 0002h
TRISIO_TRISIO2_SIZE                      equ 0001h
TRISIO_TRISIO2_LENGTH                    equ 0001h
TRISIO_TRISIO2_MASK                      equ 0004h
TRISIO_TRISIO3_POSN                      equ 0003h
TRISIO_TRISIO3_POSITION                  equ 0003h
TRISIO_TRISIO3_SIZE                      equ 0001h
TRISIO_TRISIO3_LENGTH                    equ 0001h
TRISIO_TRISIO3_MASK                      equ 0008h
TRISIO_TRISIO4_POSN                      equ 0004h
TRISIO_TRISIO4_POSITION                  equ 0004h
TRISIO_TRISIO4_SIZE                      equ 0001h
TRISIO_TRISIO4_LENGTH                    equ 0001h
TRISIO_TRISIO4_MASK                      equ 0010h
TRISIO_TRISIO5_POSN                      equ 0005h
TRISIO_TRISIO5_POSITION                  equ 0005h
TRISIO_TRISIO5_SIZE                      equ 0001h
TRISIO_TRISIO5_LENGTH                    equ 0001h
TRISIO_TRISIO5_MASK                      equ 0020h

// Register: PIE1
#define PIE1 PIE1
PIE1                                     equ 008Ch
// bitfield definitions
PIE1_TMR1IE_POSN                         equ 0000h
PIE1_TMR1IE_POSITION                     equ 0000h
PIE1_TMR1IE_SIZE                         equ 0001h
PIE1_TMR1IE_LENGTH                       equ 0001h
PIE1_TMR1IE_MASK                         equ 0001h
PIE1_CMIE_POSN                           equ 0003h
PIE1_CMIE_POSITION                       equ 0003h
PIE1_CMIE_SIZE                           equ 0001h
PIE1_CMIE_LENGTH                         equ 0001h
PIE1_CMIE_MASK                           equ 0008h
PIE1_ADIE_POSN                           equ 0006h
PIE1_ADIE_POSITION                       equ 0006h
PIE1_ADIE_SIZE                           equ 0001h
PIE1_ADIE_LENGTH                         equ 0001h
PIE1_ADIE_MASK                           equ 0040h
PIE1_EEIE_POSN                           equ 0007h
PIE1_EEIE_POSITION                       equ 0007h
PIE1_EEIE_SIZE                           equ 0001h
PIE1_EEIE_LENGTH                         equ 0001h
PIE1_EEIE_MASK                           equ 0080h
PIE1_T1IE_POSN                           equ 0000h
PIE1_T1IE_POSITION                       equ 0000h
PIE1_T1IE_SIZE                           equ 0001h
PIE1_T1IE_LENGTH                         equ 0001h
PIE1_T1IE_MASK                           equ 0001h

// Register: PCON
#define PCON PCON
PCON                                     equ 008Eh
// bitfield definitions
PCON_nBOR_POSN                           equ 0000h
PCON_nBOR_POSITION                       equ 0000h
PCON_nBOR_SIZE                           equ 0001h
PCON_nBOR_LENGTH                         equ 0001h
PCON_nBOR_MASK                           equ 0001h
PCON_nPOR_POSN                           equ 0001h
PCON_nPOR_POSITION                       equ 0001h
PCON_nPOR_SIZE                           equ 0001h
PCON_nPOR_LENGTH                         equ 0001h
PCON_nPOR_MASK                           equ 0002h
PCON_nBOD_POSN                           equ 0000h
PCON_nBOD_POSITION                       equ 0000h
PCON_nBOD_SIZE                           equ 0001h
PCON_nBOD_LENGTH                         equ 0001h
PCON_nBOD_MASK                           equ 0001h

// Register: OSCCAL
#define OSCCAL OSCCAL
OSCCAL                                   equ 0090h
// bitfield definitions
OSCCAL_CAL_POSN                          equ 0002h
OSCCAL_CAL_POSITION                      equ 0002h
OSCCAL_CAL_SIZE                          equ 0006h
OSCCAL_CAL_LENGTH                        equ 0006h
OSCCAL_CAL_MASK                          equ 00FCh
OSCCAL_CAL0_POSN                         equ 0002h
OSCCAL_CAL0_POSITION                     equ 0002h
OSCCAL_CAL0_SIZE                         equ 0001h
OSCCAL_CAL0_LENGTH                       equ 0001h
OSCCAL_CAL0_MASK                         equ 0004h
OSCCAL_CAL1_POSN                         equ 0003h
OSCCAL_CAL1_POSITION                     equ 0003h
OSCCAL_CAL1_SIZE                         equ 0001h
OSCCAL_CAL1_LENGTH                       equ 0001h
OSCCAL_CAL1_MASK                         equ 0008h
OSCCAL_CAL2_POSN                         equ 0004h
OSCCAL_CAL2_POSITION                     equ 0004h
OSCCAL_CAL2_SIZE                         equ 0001h
OSCCAL_CAL2_LENGTH                       equ 0001h
OSCCAL_CAL2_MASK                         equ 0010h
OSCCAL_CAL3_POSN                         equ 0005h
OSCCAL_CAL3_POSITION                     equ 0005h
OSCCAL_CAL3_SIZE                         equ 0001h
OSCCAL_CAL3_LENGTH                       equ 0001h
OSCCAL_CAL3_MASK                         equ 0020h
OSCCAL_CAL4_POSN                         equ 0006h
OSCCAL_CAL4_POSITION                     equ 0006h
OSCCAL_CAL4_SIZE                         equ 0001h
OSCCAL_CAL4_LENGTH                       equ 0001h
OSCCAL_CAL4_MASK                         equ 0040h
OSCCAL_CAL5_POSN                         equ 0007h
OSCCAL_CAL5_POSITION                     equ 0007h
OSCCAL_CAL5_SIZE                         equ 0001h
OSCCAL_CAL5_LENGTH                       equ 0001h
OSCCAL_CAL5_MASK                         equ 0080h

// Register: WPU
#define WPU WPU
WPU                                      equ 0095h
// bitfield definitions
WPU_WPU0_POSN                            equ 0000h
WPU_WPU0_POSITION                        equ 0000h
WPU_WPU0_SIZE                            equ 0001h
WPU_WPU0_LENGTH                          equ 0001h
WPU_WPU0_MASK                            equ 0001h
WPU_WPU1_POSN                            equ 0001h
WPU_WPU1_POSITION                        equ 0001h
WPU_WPU1_SIZE                            equ 0001h
WPU_WPU1_LENGTH                          equ 0001h
WPU_WPU1_MASK                            equ 0002h
WPU_WPU2_POSN                            equ 0002h
WPU_WPU2_POSITION                        equ 0002h
WPU_WPU2_SIZE                            equ 0001h
WPU_WPU2_LENGTH                          equ 0001h
WPU_WPU2_MASK                            equ 0004h
WPU_WPU4_POSN                            equ 0004h
WPU_WPU4_POSITION                        equ 0004h
WPU_WPU4_SIZE                            equ 0001h
WPU_WPU4_LENGTH                          equ 0001h
WPU_WPU4_MASK                            equ 0010h
WPU_WPU5_POSN                            equ 0005h
WPU_WPU5_POSITION                        equ 0005h
WPU_WPU5_SIZE                            equ 0001h
WPU_WPU5_LENGTH                          equ 0001h
WPU_WPU5_MASK                            equ 0020h

// Register: IOC
#define IOC IOC
IOC                                      equ 0096h
// bitfield definitions
IOC_IOC0_POSN                            equ 0000h
IOC_IOC0_POSITION                        equ 0000h
IOC_IOC0_SIZE                            equ 0001h
IOC_IOC0_LENGTH                          equ 0001h
IOC_IOC0_MASK                            equ 0001h
IOC_IOC1_POSN                            equ 0001h
IOC_IOC1_POSITION                        equ 0001h
IOC_IOC1_SIZE                            equ 0001h
IOC_IOC1_LENGTH                          equ 0001h
IOC_IOC1_MASK                            equ 0002h
IOC_IOC2_POSN                            equ 0002h
IOC_IOC2_POSITION                        equ 0002h
IOC_IOC2_SIZE                            equ 0001h
IOC_IOC2_LENGTH                          equ 0001h
IOC_IOC2_MASK                            equ 0004h
IOC_IOC3_POSN                            equ 0003h
IOC_IOC3_POSITION                        equ 0003h
IOC_IOC3_SIZE                            equ 0001h
IOC_IOC3_LENGTH                          equ 0001h
IOC_IOC3_MASK                            equ 0008h
IOC_IOC4_POSN                            equ 0004h
IOC_IOC4_POSITION                        equ 0004h
IOC_IOC4_SIZE                            equ 0001h
IOC_IOC4_LENGTH                          equ 0001h
IOC_IOC4_MASK                            equ 0010h
IOC_IOC5_POSN                            equ 0005h
IOC_IOC5_POSITION                        equ 0005h
IOC_IOC5_SIZE                            equ 0001h
IOC_IOC5_LENGTH                          equ 0001h
IOC_IOC5_MASK                            equ 0020h
IOC_IOCB0_POSN                           equ 0000h
IOC_IOCB0_POSITION                       equ 0000h
IOC_IOCB0_SIZE                           equ 0001h
IOC_IOCB0_LENGTH                         equ 0001h
IOC_IOCB0_MASK                           equ 0001h
IOC_IOCB1_POSN                           equ 0001h
IOC_IOCB1_POSITION                       equ 0001h
IOC_IOCB1_SIZE                           equ 0001h
IOC_IOCB1_LENGTH                         equ 0001h
IOC_IOCB1_MASK                           equ 0002h
IOC_IOCB2_POSN                           equ 0002h
IOC_IOCB2_POSITION                       equ 0002h
IOC_IOCB2_SIZE                           equ 0001h
IOC_IOCB2_LENGTH                         equ 0001h
IOC_IOCB2_MASK                           equ 0004h
IOC_IOCB3_POSN                           equ 0003h
IOC_IOCB3_POSITION                       equ 0003h
IOC_IOCB3_SIZE                           equ 0001h
IOC_IOCB3_LENGTH                         equ 0001h
IOC_IOCB3_MASK                           equ 0008h
IOC_IOCB4_POSN                           equ 0004h
IOC_IOCB4_POSITION                       equ 0004h
IOC_IOCB4_SIZE                           equ 0001h
IOC_IOCB4_LENGTH                         equ 0001h
IOC_IOCB4_MASK                           equ 0010h
IOC_IOCB5_POSN                           equ 0005h
IOC_IOCB5_POSITION                       equ 0005h
IOC_IOCB5_SIZE                           equ 0001h
IOC_IOCB5_LENGTH                         equ 0001h
IOC_IOCB5_MASK                           equ 0020h

// Register: VRCON
#define VRCON VRCON
VRCON                                    equ 0099h
// bitfield definitions
VRCON_VR_POSN                            equ 0000h
VRCON_VR_POSITION                        equ 0000h
VRCON_VR_SIZE                            equ 0004h
VRCON_VR_LENGTH                          equ 0004h
VRCON_VR_MASK                            equ 000Fh
VRCON_VRR_POSN                           equ 0005h
VRCON_VRR_POSITION                       equ 0005h
VRCON_VRR_SIZE                           equ 0001h
VRCON_VRR_LENGTH                         equ 0001h
VRCON_VRR_MASK                           equ 0020h
VRCON_VREN_POSN                          equ 0007h
VRCON_VREN_POSITION                      equ 0007h
VRCON_VREN_SIZE                          equ 0001h
VRCON_VREN_LENGTH                        equ 0001h
VRCON_VREN_MASK                          equ 0080h
VRCON_VR0_POSN                           equ 0000h
VRCON_VR0_POSITION                       equ 0000h
VRCON_VR0_SIZE                           equ 0001h
VRCON_VR0_LENGTH                         equ 0001h
VRCON_VR0_MASK                           equ 0001h
VRCON_VR1_POSN                           equ 0001h
VRCON_VR1_POSITION                       equ 0001h
VRCON_VR1_SIZE                           equ 0001h
VRCON_VR1_LENGTH                         equ 0001h
VRCON_VR1_MASK                           equ 0002h
VRCON_VR2_POSN                           equ 0002h
VRCON_VR2_POSITION                       equ 0002h
VRCON_VR2_SIZE                           equ 0001h
VRCON_VR2_LENGTH                         equ 0001h
VRCON_VR2_MASK                           equ 0004h
VRCON_VR3_POSN                           equ 0003h
VRCON_VR3_POSITION                       equ 0003h
VRCON_VR3_SIZE                           equ 0001h
VRCON_VR3_LENGTH                         equ 0001h
VRCON_VR3_MASK                           equ 0008h

// Register: EEDATA
#define EEDATA EEDATA
EEDATA                                   equ 009Ah
// bitfield definitions
EEDATA_EEDATA_POSN                       equ 0000h
EEDATA_EEDATA_POSITION                   equ 0000h
EEDATA_EEDATA_SIZE                       equ 0008h
EEDATA_EEDATA_LENGTH                     equ 0008h
EEDATA_EEDATA_MASK                       equ 00FFh

// Register: EEADR
#define EEADR EEADR
EEADR                                    equ 009Bh
// bitfield definitions
EEADR_EEADR_POSN                         equ 0000h
EEADR_EEADR_POSITION                     equ 0000h
EEADR_EEADR_SIZE                         equ 0007h
EEADR_EEADR_LENGTH                       equ 0007h
EEADR_EEADR_MASK                         equ 007Fh

// Register: EECON1
#define EECON1 EECON1
EECON1                                   equ 009Ch
// bitfield definitions
EECON1_RD_POSN                           equ 0000h
EECON1_RD_POSITION                       equ 0000h
EECON1_RD_SIZE                           equ 0001h
EECON1_RD_LENGTH                         equ 0001h
EECON1_RD_MASK                           equ 0001h
EECON1_WR_POSN                           equ 0001h
EECON1_WR_POSITION                       equ 0001h
EECON1_WR_SIZE                           equ 0001h
EECON1_WR_LENGTH                         equ 0001h
EECON1_WR_MASK                           equ 0002h
EECON1_WREN_POSN                         equ 0002h
EECON1_WREN_POSITION                     equ 0002h
EECON1_WREN_SIZE                         equ 0001h
EECON1_WREN_LENGTH                       equ 0001h
EECON1_WREN_MASK                         equ 0004h
EECON1_WRERR_POSN                        equ 0003h
EECON1_WRERR_POSITION                    equ 0003h
EECON1_WRERR_SIZE                        equ 0001h
EECON1_WRERR_LENGTH                      equ 0001h
EECON1_WRERR_MASK                        equ 0008h

