GopalSaraf/Practicals/PSDL/include/proc/pic12f675.inc
// Register: EECON2
#define EECON2 EECON2
EECON2                                   equ 009Dh
// bitfield definitions
EECON2_EECON2_POSN                       equ 0000h
EECON2_EECON2_POSITION                   equ 0000h
EECON2_EECON2_SIZE                       equ 0008h
EECON2_EECON2_LENGTH                     equ 0008h
EECON2_EECON2_MASK                       equ 00FFh

// Register: ADRESL
#define ADRESL ADRESL
ADRESL                                   equ 009Eh
// bitfield definitions
ADRESL_ADRESL_POSN                       equ 0000h
ADRESL_ADRESL_POSITION                   equ 0000h
ADRESL_ADRESL_SIZE                       equ 0008h
ADRESL_ADRESL_LENGTH                     equ 0008h
ADRESL_ADRESL_MASK                       equ 00FFh

// Register: ANSEL
#define ANSEL ANSEL
ANSEL                                    equ 009Fh
// bitfield definitions
ANSEL_ANS_POSN                           equ 0000h
ANSEL_ANS_POSITION                       equ 0000h
ANSEL_ANS_SIZE                           equ 0004h
ANSEL_ANS_LENGTH                         equ 0004h
ANSEL_ANS_MASK                           equ 000Fh
ANSEL_ADCS_POSN                          equ 0004h
ANSEL_ADCS_POSITION                      equ 0004h
ANSEL_ADCS_SIZE                          equ 0003h
ANSEL_ADCS_LENGTH                        equ 0003h
ANSEL_ADCS_MASK                          equ 0070h
ANSEL_ANS0_POSN                          equ 0000h
ANSEL_ANS0_POSITION                      equ 0000h
ANSEL_ANS0_SIZE                          equ 0001h
ANSEL_ANS0_LENGTH                        equ 0001h
ANSEL_ANS0_MASK                          equ 0001h
ANSEL_ANS1_POSN                          equ 0001h
ANSEL_ANS1_POSITION                      equ 0001h
ANSEL_ANS1_SIZE                          equ 0001h
ANSEL_ANS1_LENGTH                        equ 0001h
ANSEL_ANS1_MASK                          equ 0002h
ANSEL_ANS2_POSN                          equ 0002h
ANSEL_ANS2_POSITION                      equ 0002h
ANSEL_ANS2_SIZE                          equ 0001h
ANSEL_ANS2_LENGTH                        equ 0001h
ANSEL_ANS2_MASK                          equ 0004h
ANSEL_ANS3_POSN                          equ 0003h
ANSEL_ANS3_POSITION                      equ 0003h
ANSEL_ANS3_SIZE                          equ 0001h
ANSEL_ANS3_LENGTH                        equ 0001h
ANSEL_ANS3_MASK                          equ 0008h
ANSEL_ADCS0_POSN                         equ 0004h
ANSEL_ADCS0_POSITION                     equ 0004h
ANSEL_ADCS0_SIZE                         equ 0001h
ANSEL_ADCS0_LENGTH                       equ 0001h
ANSEL_ADCS0_MASK                         equ 0010h
ANSEL_ADCS1_POSN                         equ 0005h
ANSEL_ADCS1_POSITION                     equ 0005h
ANSEL_ADCS1_SIZE                         equ 0001h
ANSEL_ADCS1_LENGTH                       equ 0001h
ANSEL_ADCS1_MASK                         equ 0020h
ANSEL_ADCS2_POSN                         equ 0006h
ANSEL_ADCS2_POSITION                     equ 0006h
ANSEL_ADCS2_SIZE                         equ 0001h
ANSEL_ADCS2_LENGTH                       equ 0001h
ANSEL_ADCS2_MASK                         equ 0040h

/*
 * Bit Access Macros
 */

#ifndef PAGEMASK
#define PAGEMASK(addr) ((addr) and 07FFh)
#endif
#ifndef BANKMASK
#define BANKMASK(addr) ((addr) and 07Fh)
#endif
#define ADCS0                            BANKMASK(ANSEL), 4
#define ADCS1                            BANKMASK(ANSEL), 5
#define ADCS2                            BANKMASK(ANSEL), 6
#define ADFM                             BANKMASK(ADCON0), 7
#define ADIE                             BANKMASK(PIE1), 6
#define ADIF                             BANKMASK(PIR1), 6
#define ADON                             BANKMASK(ADCON0), 0
#define ANS0                             BANKMASK(ANSEL), 0
#define ANS1                             BANKMASK(ANSEL), 1
#define ANS2                             BANKMASK(ANSEL), 2
#define ANS3                             BANKMASK(ANSEL), 3
#define CAL0                             BANKMASK(OSCCAL), 2
#define CAL1                             BANKMASK(OSCCAL), 3
#define CAL2                             BANKMASK(OSCCAL), 4
#define CAL3                             BANKMASK(OSCCAL), 5
#define CAL4                             BANKMASK(OSCCAL), 6
#define CAL5                             BANKMASK(OSCCAL), 7
#define CARRY                            BANKMASK(STATUS), 0
#define CHS0                             BANKMASK(ADCON0), 2
#define CHS1                             BANKMASK(ADCON0), 3
#define CINV                             BANKMASK(CMCON), 4
#define CIS                              BANKMASK(CMCON), 3
#define CM0                              BANKMASK(CMCON), 0
#define CM1                              BANKMASK(CMCON), 1
#define CM2                              BANKMASK(CMCON), 2
#define CMIE                             BANKMASK(PIE1), 3
#define CMIF                             BANKMASK(PIR1), 3
#define COUT                             BANKMASK(CMCON), 6
#define DC                               BANKMASK(STATUS), 1
#define EEIE                             BANKMASK(PIE1), 7
#define EEIF                             BANKMASK(PIR1), 7
#define GIE                              BANKMASK(INTCON), 7
#define GO                               BANKMASK(ADCON0), 1
#define GO_DONE                          BANKMASK(ADCON0), 1
#define GO_nDONE                         BANKMASK(ADCON0), 1
#define GP0                              BANKMASK(GPIO), 0
#define GP1                              BANKMASK(GPIO), 1
#define GP2                              BANKMASK(GPIO), 2
#define GP3                              BANKMASK(GPIO), 3
#define GP4                              BANKMASK(GPIO), 4
#define GP5                              BANKMASK(GPIO), 5
#define GPIE                             BANKMASK(INTCON), 3
#define GPIF                             BANKMASK(INTCON), 0
#define GPIO0                            BANKMASK(GPIO), 0
#define GPIO1                            BANKMASK(GPIO), 1
#define GPIO2                            BANKMASK(GPIO), 2
#define GPIO3                            BANKMASK(GPIO), 3
#define GPIO4                            BANKMASK(GPIO), 4
#define GPIO5                            BANKMASK(GPIO), 5
#define INTE                             BANKMASK(INTCON), 4
#define INTEDG                           BANKMASK(OPTION_REG), 6
#define INTF                             BANKMASK(INTCON), 1
#define IOC0                             BANKMASK(IOC), 0
#define IOC1                             BANKMASK(IOC), 1
#define IOC2                             BANKMASK(IOC), 2
#define IOC3                             BANKMASK(IOC), 3
#define IOC4                             BANKMASK(IOC), 4
#define IOC5                             BANKMASK(IOC), 5
#define IOCB0                            BANKMASK(IOC), 0
#define IOCB1                            BANKMASK(IOC), 1
#define IOCB2                            BANKMASK(IOC), 2
#define IOCB3                            BANKMASK(IOC), 3
#define IOCB4                            BANKMASK(IOC), 4
#define IOCB5                            BANKMASK(IOC), 5
#define PEIE                             BANKMASK(INTCON), 6
#define PS0                              BANKMASK(OPTION_REG), 0
#define PS1                              BANKMASK(OPTION_REG), 1
#define PS2                              BANKMASK(OPTION_REG), 2
#define PSA                              BANKMASK(OPTION_REG), 3
#define RD                               BANKMASK(EECON1), 0
#define RP0                              BANKMASK(STATUS), 5
#define RP1                              BANKMASK(STATUS), 6
#define T0CS                             BANKMASK(OPTION_REG), 5
#define T0IE                             BANKMASK(INTCON), 5
#define T0IF                             BANKMASK(INTCON), 2
#define T0SE                             BANKMASK(OPTION_REG), 4
#define T1CKPS0                          BANKMASK(T1CON), 4
#define T1CKPS1                          BANKMASK(T1CON), 5
#define T1IE                             BANKMASK(PIE1), 0
#define T1IF                             BANKMASK(PIR1), 0
#define T1OSCEN                          BANKMASK(T1CON), 3
#define TMR0IE                           BANKMASK(INTCON), 5
#define TMR0IF                           BANKMASK(INTCON), 2
#define TMR1CS                           BANKMASK(T1CON), 1
#define TMR1GE                           BANKMASK(T1CON), 6
#define TMR1IE                           BANKMASK(PIE1), 0
#define TMR1IF                           BANKMASK(PIR1), 0
#define TMR1ON                           BANKMASK(T1CON), 0
#define TRISIO0                          BANKMASK(TRISIO), 0
#define TRISIO1                          BANKMASK(TRISIO), 1
#define TRISIO2                          BANKMASK(TRISIO), 2
#define TRISIO3                          BANKMASK(TRISIO), 3
#define TRISIO4                          BANKMASK(TRISIO), 4
#define TRISIO5                          BANKMASK(TRISIO), 5
#define VCFG                             BANKMASK(ADCON0), 6
#define VR0                              BANKMASK(VRCON), 0
#define VR1                              BANKMASK(VRCON), 1
#define VR2                              BANKMASK(VRCON), 2
#define VR3                              BANKMASK(VRCON), 3
#define VREN                             BANKMASK(VRCON), 7
#define VRR                              BANKMASK(VRCON), 5
#define WPU0                             BANKMASK(WPU), 0
#define WPU1                             BANKMASK(WPU), 1
#define WPU2                             BANKMASK(WPU), 2
#define WPU4                             BANKMASK(WPU), 4
#define WPU5                             BANKMASK(WPU), 5
#define WR                               BANKMASK(EECON1), 1
#define WREN                             BANKMASK(EECON1), 2
#define WRERR                            BANKMASK(EECON1), 3
#define ZERO                             BANKMASK(STATUS), 2
#define nBOD                             BANKMASK(PCON), 0
#define nBOR                             BANKMASK(PCON), 0
#define nDONE                            BANKMASK(ADCON0), 1
#define nGPPU                            BANKMASK(OPTION_REG), 7
#define nPD                              BANKMASK(STATUS), 3
#define nPOR                             BANKMASK(PCON), 1
#define nT1SYNC                          BANKMASK(T1CON), 2
#define nTO                              BANKMASK(STATUS), 4

/*
 * Device Psects
 */

#ifdef _XC_INC_

// Memory Spaces
#define SPACE_CODE   0
#define SPACE_DATA   1
#define SPACE_EEPROM 3

psect udata,class=RAM,space=SPACE_DATA,noexec
psect udata_bank0,class=BANK0,space=SPACE_DATA,noexec
psect code,class=CODE,space=SPACE_CODE,delta=2
psect data,class=STRCODE,space=SPACE_CODE,delta=2,noexec
psect edata,class=EEDATA,space=SPACE_EEPROM,delta=2,noexec

#endif // _XC_INC_

#endif // _PIC12F675_INC_
